Repository: tanDivina/codegeist-seamless-linguaflow
Catalog: Seamless-LinguaFlow/sample-files/sample-tmx.tmx
Source language: en
Languages: es

source: Save your work regularly
es: Guarde su trabajo regularmente

source: Click the Submit button to proceed
es: Haga clic en el bot칩n Enviar para continuar

source: The system will automatically backup your data
es: El sistema har치 una copia de seguridad autom치tica de sus datos
